#+TITLE:Introduction to Programming in C
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:CSC 100 - Lyon College - Spring 2025
#+SEQ_TODO: PRACTICE | DONE
#+STARTUP: overview hideblocks indent entitiespretty
#+property: :header-args:C:      :main yes :includes <stdio.h> :results output :exports both
#+property: :header-args:python: :session *Python* :python python3 :results output :exports both
#+property: :header-args:R:      :session *R* :results graphics output file :exports both
#+property: :header-args:C++:    :main yes :includes <iostream> :results output :exports both
#+options: toc:1 num:1 ^:nil:
#+latex_header: \usepackage{float}
#+attr_latex: float:nil
* Why don't we just learn C++?

- For comparison: "Hello world" program in C and C++

- "Hello world" in C
  #+begin_src C :results output
    #include <stdio.h>

    int main(void) {
      puts("Hello, world");
      return 0;
    }
  #+end_src

  #+RESULTS:
  : Hello, world

- "Hello world in C++
  #+begin_src C++ :results output
    #include <iostream>

    int main(void) {
      std::cout << "Hello, world!" << std::endl;
      return 0;
    }
  #+end_src

  #+RESULTS:
  : Hello, world!

- Object-orientation is a difficult paradigm for beginners (C++).
- System programming is pure power (C).
- C is simpler, smaller, and faster.
- C has 35 keywords, C++ has 95.

* Tips and Extensions

1. It is advisable, especially at the start, to err on the side of
   over-commenting. Creating comments will be your first assignment.

2. Things to try when writing the program:
   - What happens if you compile with =printf();= ?
   - What happens if you leave out the =int= before =main=?
   - What happens if you remove the last line, =return 0;= ?
   - What happens if you remove everything but =main() {}=?

3. Things to try when compiling and running the program on a shell
   (you cannot do this in the OneCompiler IDE):
   - Run the program again with the command: =./a.out > hello=
   - Look at the output file with: =cat hello=
   - Compile again with: =gcc hello.c -o hello.out=
   - Run the program with the command: =./hello.out=
   - Run the program again with the command: =./hello.out > hello.txt=
   - Look at the output file with: =cat hello.txt=
   - List all files starting with =hello=, with: =ls hello*=

Explanation:
#+begin_comment
- The =printf= command requires a non-empty argument, at least =""=.

- The =main= program will still run in its reduced form. The complete
form is quite a bit more complicated.

- =gcc [source] -o [target]= creates object code (executable) named
=target=.

- You can also redirect the output from the executable to a file using
the /redirection/ shell operator =>=.
#+end_comment

For illustration, here is a complete =main= program: The argument is not
=void= (missing) but instead contains the number of arguments =argc=, and
an array of pointers =argv[]= to each argument passed to the program.

#+begin_src C :main no :includes
  #include <stdio.h>

  int main(int argc, char *argv[])
  {
    printf("Hello, world!\n");
    return 0;
  }
#+end_src

#+RESULTS:
: Hello, world!

